
&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	ПереключитьОтображениеЭлементов();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПереключитьОтображениеЭлементов();
КонецПроцедуры

Процедура ПереключитьОтображениеЭлементов()
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
		Элементы.ГруппаРеквизитыДоговораОбслуживания.Видимость = Истина;
	Иначе
		Элементы.ГруппаРеквизитыДоговораОбслуживания.Видимость = Ложь;
	КонецЕсли
КонецПроцедуры
