
#Область ОбработчикиСобытийФормы 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	 
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если НЕ ЗначениеЗаполнено(Объект.Клиент) 
	ИЛИ НЕ ЗначениеЗаполнено(Объект.Договор) 
	ИЛИ НЕ ЗначениеЗаполнено(Объект.Специалист)
	ИЛИ НЕ ЗначениеЗаполнено(Объект.ВремяНачалаРабот) 
	ИЛИ НЕ ЗначениеЗаполнено(Объект.ВремяОкончанияРабот) 
	ИЛИ НЕ ЗначениеЗаполнено(Объект.ОписаниеПроблемы) Тогда
		СообщитьПользователюНаСервере("Перед записью заполните обязательные для заполнения реквизиты.");
		Отказ = Истина;			
	КонецЕсли;
	Если ДоговорНеДействителенФорма() Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы

#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
    
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
    
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
    
КонецПроцедуры
&НаСервере
Процедура СообщитьПользователюНаСервере(Текст)
	ОбщегоНазначения.СообщитьПользователю(Текст);
КонецПроцедуры

&НаСервере
Функция ДоговорНеДействителенФорма()
	Результат = Ложь;
	ДанныеДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Договор, "ВКМ_ДатаНачалаДействияДоговора, 
	|ВКМ_ДатаОкончанияДействияДоговора, ВидДоговора, ВКМ_СтоимостьЧасаРаботыСпециалиста");
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	Если ДокументОбъект.ДоговорНеДействителен(ДанныеДоговора.ВидДоговора,
	ДанныеДоговора.ВКМ_ДатаНачалаДействияДоговора,ДанныеДоговора.ВКМ_ДатаОкончанияДействияДоговора) Тогда
		Результат = Истина;
	КонецЕсли;
	Возврат Результат;
	
КонецФункции

#КонецОбласти
