#Область СлужебныеПроцедурыИФункции

Процедура ОтправкаУведомленияТелеграмБоту()Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_УведомленияТелеграмБоту.Ссылка,
	|	ВКМ_УведомленияТелеграмБоту.ТекстСообщения
	|ИЗ
	|	Справочник.ВКМ_УведомленияТелеграмБоту КАК ВКМ_УведомленияТелеграмБоту
	|ГДЕ
	|	ВКМ_УведомленияТелеграмБоту.ПометкаУдаления = ЛОЖЬ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ТекстСообщения = Выборка.Текст;
		Если ОтправитьСообщениеЧерезТелеграмБота(ТекстСообщения) Тогда 
			Выборка.Ссылка.ПолучитьОбъект().Удалить();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ОтправитьСообщениеЧерезТелеграмБота(ТекстСообщения) 
		
	ИдентификаторГруппы = Константы.ВКМ_ИдентификаторГруппыДляОповещения.Получить(); 
	Токен = Константы.ВКМ_ТокенУправленияТелеграмБотом.Получить();
	Результат = Истина;
	Ресурс = "bot"+Токен+"/sendMessage?chat_id="+ИдентификаторГруппы+"&text="+ТекстСообщения;
	
	Соединение = Новый HTTPСоединение("api.telegram.org",,,,,,Новый ЗащищенноеСоединениеOpenSSL);
	Запрос = Новый HTTPЗапрос(Ресурс); 
	Запрос.Заголовки.Вставить("Content-type","application/json"); 
	
	Ответ = Соединение.Получить(Запрос); 
	
	Если Ответ.КодСостояния <> 200 Тогда
		СтрокаОтвета = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации("HTTPСервисы.Ошибка",УровеньЖурналаРегистрации.Ошибка,,,СтрокаОтвета,);
		Результат = Ложь;
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации("HTTPСервисы.Отправка",УровеньЖурналаРегистрации.Информация,,,"Сообщение отправлено",);
	
	Возврат Результат;
	
КонецФункции

Процедура СоздатьУведомлениеТелеграмБоту(ТекстУведомления) Экспорт

	НовоеУведомление = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
	НовоеУведомление.ТекстСообщения = ТекстУведомления;
	НовоеУведомление.Записать();

КонецПроцедуры

#КонецОбласти