#Область ПрограммныйИнтерфейс 

Процедура ВКМ_ДобавитьЭлементыФормы(Форма) Экспорт
	
	ИмяФормы = Форма.ИмяФормы;
	
	Если ИмяФормы = "Справочник.ДоговорыКонтрагентов.Форма.ФормаЭлемента" Тогда 
			
		ВКМ_ДобавитьВДоговорыКонтрагентов(Форма);  
		
	ИначеЕсли  ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		
		ВКМ_ДобавитьВРеализацияТоваровУслуг(Форма);
				
	КонецЕсли;
	
КонецПроцедуры 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ВКМ_ДобавитьВДоговорыКонтрагентов(Форма) 
	
	ГруппаДопРеквизиты = Форма.Элементы.Добавить("ГруппаДопРеквизиты", Тип("ГруппаФормы"));
	ГруппаДопРеквизиты.Вид = ВидГруппыФормы.ОбычнаяГруппа; 
	ГруппаДопРеквизиты.ОтображатьЗаголовок = Ложь;
	ГруппаДопРеквизиты.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	ПолеВвода = Форма.Элементы.Добавить("ВКМ_ДатаНачалаДействияДоговора", Тип("ПолеФормы"), Форма.Элементы.ГруппаДопРеквизиты);
	ПолеВвода.Заголовок = "Дата начала действия договора";
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_ДатаНачалаДействияДоговора";
	
	ПолеВвода = Форма.Элементы.Добавить("ВКМ_ДатаОкончанияДействияДоговора", Тип("ПолеФормы"), Форма.Элементы.ГруппаДопРеквизиты);
	ПолеВвода.Заголовок = "Дата окончания действия договора";
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода; 
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_ДатаОкончанияДействияДоговора";
	
	ПолеВвода = Форма.Элементы.Добавить("ВКМ_АбонентскаяПлата", Тип("ПолеФормы"), Форма.Элементы.ГруппаДопРеквизиты);
	ПолеВвода.Заголовок = "Сумма абоненсткой платы";
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_АбонентскаяПлата";
	
	ПолеВвода = Форма.Элементы.Добавить("ВКМ_СтоимостьЧасаРаботыСпециалиста", Тип("ПолеФормы"), Форма.Элементы.ГруппаДопРеквизиты);
	ПолеВвода.Заголовок = "Стоимость часа работы специалиста";
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботыСпециалиста";
	
КонецПроцедуры   

Процедура ВКМ_ДобавитьВРеализацияТоваровУслуг(Форма)

//	Команда = Форма.Команды.Добавить("ВКМ_КомандаЗаполнить");
//	Команда.Действие = "ВКМ_ДействиеЗаполнить";
//	
//	Кнопка = Форма.Элементы.Добавить("ВКМ_КнопкаЗаполнить", Тип("КнопкаФормы"), Форма.Элементы.УслугиКоманднаяПанель);
//	Кнопка.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
//	Кнопка.ИмяКоманды = "ВКМ_КомандаЗаполнить";
//	Кнопка.Заголовок = "Заполнить";
	
	НоваяКоманда = Форма.Команды.Добавить("Заполнить");
	НоваяКоманда.Заголовок = "Заполнить";
	НоваяКоманда.Действие = "ВКМ_Заполнить";	
	Кнопка = Форма.Элементы.Добавить("ВКМ_Заполнить", Тип("КнопкаФормы"), Форма.Элементы.УслугиКоманднаяПанель);
	Кнопка.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	Кнопка.ИмяКоманды = "Заполнить";	
КонецПроцедуры

#КонецОбласти