
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция  СоздатьАктыНаСервере(Период) Экспорт 
	
	Таблица = ПолучитьДанныеПоДоговорам(Период);
	
	МассивДляТЧ = Новый Массив;
	
	Для Каждого СтрокаТЗ Из Таблица Цикл 
		
		Если НЕ ЗначениеЗаполнено(СтрокаТЗ.Реализация) Тогда 
			
			МассивДляТЧ.Добавить(Новый Структура("Договор, Реализация", СтрокаТЗ.Договор, СоздатьДокументРеализации(СтрокаТЗ, КонецМесяца(Период))));
			Продолжить;
			
		КонецЕсли;
		
		МассивДляТЧ.Добавить(Новый Структура("Договор, Реализация", СтрокаТЗ.Договор, СтрокаТЗ.РеализацияТоваровУслуг));
		
	КонецЦикла;
	
	Возврат МассивДляТЧ;
	
КонецФункции

Функция  ПолучитьДанныеПоДоговорам(Период) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Договор,
	|	РеализацияТоваровУслуг.Ссылка КАК Реализация,
	|	ДоговорыКонтрагентов.Владелец,
	|	ДоговорыКонтрагентов.Организация
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО РеализацияТоваровУслуг.Договор = ДоговорыКонтрагентов.Ссылка
	|		И НЕ РеализацияТоваровУслуг.ПометкаУдаления
	|		И РеализацияТоваровУслуг.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|ГДЕ
	|	ДоговорыКонтрагентов.ВКМ_ДатаНачалаДействияДоговора <= &НачалоПериода
	|	И ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДействияДоговора >= &КонецПериода
	|	И ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
	|	И НЕ ДоговорыКонтрагентов.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Период));
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Период));
	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание);
	ТабЗнач = Запрос.Выполнить().Выгрузить();
	
	Возврат ТабЗнач;

КонецФункции

Функция СоздатьДокументРеализации(СтрокаТЗ, Дата)
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("Организация", СтрокаТЗ.Организация);
	ДанныеЗаполнения.Вставить("Контрагент", СтрокаТЗ.Владелец);
	ДанныеЗаполнения.Вставить("Договор", СтрокаТЗ.Договор);
	
	НовыйДокумент = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
	НовыйДокумент.Заполнить(ДанныеЗаполнения);
	НовыйДокумент.Комментарий = "Документ создан обработкой ""Массовое создание актов"".";
	НовыйДокумент.Дата = Дата;
	НовыйДокумент.ВКМ_ВыполнитьАвтозаполнение();
	НовыйДокумент.ПроверитьЗаполнение();
	НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
	
	Возврат НовыйДокумент.Ссылка;

КонецФункции

Процедура ДобавитьСтрокуВТЧ(Договор, Реализация, ТабЧасть) Экспорт
	
	НоваяСтрокаТБ = ТабЧасть.Добавить();
	НоваяСтрокаТБ.Договор = Договор;
	НоваяСтрокаТБ.Реализация = Реализация;
	
КонецПроцедуры


#КонецОбласти

#КонецЕсли
