#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьУсловноеОформление(); 
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОтпускаСотрудников
&НаКлиенте
Процедура ОтпускаСотрудниковДатаНачалаПриИзменении(Элемент)
	ПриИзмененииДаты();
КонецПроцедуры


&НаКлиенте
Процедура ОтпускаСотрудниковДатаОкончанияПриИзменении(Элемент)
	ПриИзмененииДаты();
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковПослеУдаления(Элемент)
	ПриИзмененииДаты();
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура АнализГрафика(Команда)
	
	Адрес = ПоместитьВоВременноеХранилищеНаСервере();
	ПараметрыФормы = Новый Структура("Адрес", Адрес);
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика",ПараметрыФормы,ЭтотОбъект);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Функция ПоместитьВоВременноеХранилищеНаСервере()
	
	Возврат ПоместитьВоВременноеХранилище(Объект.ОтпускаСотрудников.Выгрузить(,"Сотрудник,ДатаНачала,ДатаОкончания")); 
	
КонецФункции

&НаКлиенте
Процедура ПриИзмененииДаты()

ТекущиеДанные = Элементы.ОтпускаСотрудников.ТекущиеДанные;
	ТекущиеДанные.ДнейОтпуска = (КонецДня(ТекущиеДанные.ДатаОкончания) -  НачалоДня(ТекущиеДанные.ДатаНачала)) / (60*60*24);
	
	ВыделитьСтроки();	

КонецПроцедуры

&НаСервере
Процедура ВыделитьСтроки()

	ТабЗнач =  Объект.ОтпускаСотрудников.Выгрузить(,"Сотрудник, ДнейОтпуска" );
	ТабЗнач.Свернуть("Сотрудник", "ДнейОтпуска");
	
	Для Каждого Колонка ИЗ ТабЗнач Цикл
		Если Колонка.ДнейОтпуска >  28  Тогда 
		    
		    Для Каждого Строка Из Объект.ОтпускаСотрудников Цикл
		    	
		    	Если Строка.Сотрудник = Колонка.Сотрудник Тогда		    		
		    		Строка.Более28дней = ИСТИНА;
		    	КонецЕсли;
		    		
		    КонецЦикла;
		Иначе
			Для Каждого Строка Из Объект.ОтпускаСотрудников Цикл
		    	Если Строка.Сотрудник = Колонка.Сотрудник Тогда
		    		Строка.Более28дней = ЛОЖЬ;
		    	КонецЕсли;
		    КонецЦикла;
		КонецЕсли;	
	КонецЦикла;	

КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	ЭлементОформления = УсловноеОформление.Элементы.Добавить(); 
	ЭлементОформления.Использование = Истина;  
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Желтый);
	ЭлементУсловия = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ОтпускаСотрудников.Более28дней"); 
	ЭлементУсловия.ПравоеЗначение = ИСТИНА; 
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементУсловия.Использование = Истина; 
	ОформляемоеПоле = ЭлементОформления.Поля.Элементы.Добавить(); 
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ОтпускаСотрудниковСотрудник");
	
КонецПроцедуры
#КонецОбласти