//Начало ВКМ_доработки
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ВКМ_УстановитьВидимость();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ВКМ_УстановитьВидимость(); 
	
КонецПроцедуры


#КонецОбласти  

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
	ВКМ_УстановитьВидимость();
	
КонецПроцедуры  

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВКМ_УстановитьВидимость() 
	
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
		Элементы.ГруппаДопРеквизиты.Видимость = Истина; 
	Иначе
		Элементы.ГруппаДопРеквизиты.Видимость = Ложь;
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти
//Конец ВКМ_доработки